{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This notebook creates product entities (whether or not they already exist in the graph), and creates Company entities (merges them from the source table so there is only one of each, but does not merge against the graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "metadata": {},
   "outputs": [],
   "source": [
    "import arcpy\n",
    "from arcgis.gis import GIS\n",
    "from arcgis.graph import KnowledgeGraph, Entity, EntityType, Relationship, RelationshipType, GraphProperty\n",
    "from uuid import uuid4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "metadata": {},
   "outputs": [],
   "source": [
    "sourceTable = \"C:\\\\DemoData\\\\KNOW\\\\SupplyChain\\\\SupplyChain.gdb\\\\Products\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 202,
   "metadata": {},
   "outputs": [],
   "source": [
    "gis = GIS('Pro')\n",
    "desc = arcpy.da.Describe(sourceTable)\n",
    "arcpy.env.workspace = desc['path']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "metadata": {},
   "outputs": [],
   "source": [
    "kg = KnowledgeGraph(url='https://ebase.ad.local/server/rest/services/Hosted/SupplyChain_unfinished_python/KnowledgeGraphServer', gis=gis)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create a list of fields we want to carry over form the source table"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 204,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Field object at 0x1d02d0d2e40[0x210fbf19690]>,\n",
       " <Field object at 0x1d02d0d27b0[0x210fbf1b290]>,\n",
       " <Field object at 0x210ff1ccad0[0x210fbf1b190]>,\n",
       " <Field object at 0x210ff1cc1a0[0x210fbf1afd0]>,\n",
       " <Field object at 0x210ff1cc830[0x210fbf1b130]>]"
      ]
     },
     "execution_count": 204,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fldsList = [fld for fld in arcpy.ListFields(desc['baseName']) if fld.name != \"OBJECTID\"]\n",
    "fldsList"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create a new Entity Type and Relationship Type"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create Entity Types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "metadata": {},
   "outputs": [],
   "source": [
    "productEntityType = EntityType(name=\"Product\", properties={\n",
    "            \"ProductName\": GraphProperty(name=\"ProductName\", field_type='esriFieldTypeString'),\n",
    "            \"Parts\": GraphProperty(name=\"Parts\", field_type='esriFieldTypeString'),\n",
    "            \"MSRP_Num\": GraphProperty(name=\"MSRP_Num\", field_type='esriFieldTypeDouble')})\n",
    "companyEntityType = EntityType(name=\"Company\", properties={\n",
    "            \"CompanyName\": GraphProperty(name=\"CompanyName\", field_type='esriFieldTypeString')})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create Relationship Type"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 206,
   "metadata": {},
   "outputs": [],
   "source": [
    "sellsProductRelType = RelationshipType(name=\"SellsProduct\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Edit KG Data Model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "NamedObjectTypeAddsResponse(error=None, entity_add_results=[NamedObjectTypeAddResult(name='Product', error=None), NamedObjectTypeAddResult(name='Company', error=None)], relationship_add_results=[NamedObjectTypeAddResult(name='SellsProduct', error=None)])"
      ]
     },
     "execution_count": 207,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.named_object_type_adds(\n",
    "    entity_types=[productEntityType, companyEntityType], \n",
    "    relationship_types=[sellsProductRelType],\n",
    "    as_dict=False\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Read source data with cursor for editing"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Flow:\n",
    "1. Create a python `set` to get unique values of he Company names, knowing that there are repeats\n",
    "2. Read data as a search cursor\n",
    "3. Create Origin Entities in the KG, if not already in the KG\n",
    "4. Iterate over each company's products and build destination Entities and Relationships\n",
    "5. The users has to create the logic to merge entities within the source and within the KG."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Generate a unique list of input Entity names to handle merging"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Bell Ltd',\n",
       " 'David-Baker',\n",
       " 'Kennedy, Hanson and Aguilar',\n",
       " 'Kim PLC',\n",
       " 'Moody-Martin',\n",
       " 'Phillips, Smith and Fuller',\n",
       " 'Rivera-Thomas',\n",
       " 'Wood, Gonzalez and Carter'}"
      ]
     },
     "execution_count": 208,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "uniqueCompanyNames = [row[0] for row in arcpy.da.SearchCursor(sourceTable, [\"CompanyName\"])]\n",
    "set(uniqueCompanyNames)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Iterate over the source table's companies to build the KG\n",
    "To handle merging against KG entities, we are going to search for the name of the company from the source table in the query results. If it exists, don't make a new entity. If it does not exist, make a new entity. This is a list of the returned entities from the query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:/Users/tim10393/AppData/Local/Temp/1/ArcGISProTemp35796/xpython_35796/4075987014.py:1: DeprecationWarning: In the future, the as_dict parameter will be removed, and the behavior will be as though as_dict is False. Setting as_dict to False is recommended.\n",
      "  kgCompanyEntities = [result[0] for result in kg.query_streaming(\"MATCH (c:Company) RETURN c\")]\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wood, Gonzalez and Carter\n",
      "The entity needs created\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:/Users/tim10393/AppData/Local/Temp/1/ArcGISProTemp35796/xpython_35796/4075987014.py:21: DeprecationWarning: In the future, the as_dict parameter will be removed, and the behavior will be as though as_dict is False. Setting as_dict to False is recommended.\n",
      "  kg.apply_edits(adds=[originEnt])\n",
      "C:/Users/tim10393/AppData/Local/Temp/1/ArcGISProTemp35796/xpython_35796/4075987014.py:35: DeprecationWarning: In the future, the as_dict parameter will be removed, and the behavior will be as though as_dict is False. Setting as_dict to False is recommended.\n",
      "  kg.apply_edits(adds=[destEnt])\n",
      "C:/Users/tim10393/AppData/Local/Temp/1/ArcGISProTemp35796/xpython_35796/4075987014.py:36: DeprecationWarning: In the future, the as_dict parameter will be removed, and the behavior will be as though as_dict is False. Setting as_dict to False is recommended.\n",
      "  kg.apply_edits(adds=[rel])\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Product 1', 'Product 8', 'Product 12', 'Product 14']\n",
      "\n",
      "Kim PLC\n",
      "The entity needs created\n",
      "['Product 2', 'Product 6', 'Product 7', 'Product 9', 'Product 10']\n",
      "\n",
      "Kennedy, Hanson and Aguilar\n",
      "The entity needs created\n",
      "['Product 3']\n",
      "\n",
      "Bell Ltd\n",
      "The entity needs created\n",
      "['Product 15']\n",
      "\n",
      "Rivera-Thomas\n",
      "The entity needs created\n",
      "['Product 5', 'Product 11']\n",
      "\n",
      "Phillips, Smith and Fuller\n",
      "The entity needs created\n",
      "['Product 16']\n",
      "\n",
      "Moody-Martin\n",
      "The entity needs created\n",
      "['Product 13']\n",
      "\n",
      "David-Baker\n",
      "The entity needs created\n",
      "['Product 4']\n",
      "\n",
      "Edits complete\n"
     ]
    }
   ],
   "source": [
    "kgCompanyEntities = [result[0] for result in kg.query_streaming(\"MATCH (c:Company) RETURN c\")]\n",
    "kgCompanyEntityNames = [ent['_properties']['CompanyName'] for ent in kgCompanyEntities] \n",
    "\n",
    "relDict = {} # Origin ID : Destination Product Name\n",
    "\n",
    "for company in set(uniqueCompanyNames):\n",
    "    print(company)\n",
    "    q = f\"CompanyName = '{company}'\"\n",
    "\n",
    "    # Create the Company Entities as needed\n",
    "    if company in kgCompanyEntityNames:\n",
    "        print(\"The company exists, getting the Entity\")\n",
    "        for ent in kgCompanyEntities:\n",
    "            if company == ent['_properties']['CompanyName']:\n",
    "                originID = str(ent['_properties']['globalid'])\n",
    "    else:\n",
    "        print(\"The entity needs created\")\n",
    "        originID = uuid4()\n",
    "        originEnt = Entity(type_name=\"Company\", properties={\"CompanyName\": company}, id=originID)\n",
    "        # Need to create the origin Entity first, then the rest. Otherwise, the editing won't complete accuratley\n",
    "        kg.apply_edits(adds=[originEnt])\n",
    "\n",
    "    productList = []\n",
    "\n",
    "    # Create the Product Entities as needed\n",
    "\n",
    "    sCur = arcpy.da.SearchCursor(sourceTable, [fld.name for fld in fldsList], where_clause=q)\n",
    "\n",
    "    # Iterate over each row for each company, create the destination Entity and build the relationship\n",
    "    for row in sCur:\n",
    "        productList.append(row[0])\n",
    "        destID = uuid4()\n",
    "        destEnt = Entity(type_name=\"Product\", properties={\"ProductName\": row[0], \"Parts\": row[1], \"MSRP_Num\": row[4]}, id=destID)\n",
    "        rel = Relationship(type_name=\"SellsProduct\", origin_entity_id=originID, destination_entity_id=destID)\n",
    "        kg.apply_edits(adds=[destEnt])\n",
    "        kg.apply_edits(adds=[rel])\n",
    "    print(productList)\n",
    "    del sCur\n",
    "    print()\n",
    "print(\"Edits complete\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This code works. But, if you run it again, the Products are duplicated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "ArcGISPro",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
